[
  {
    "index": 0,
    "takim_adi": "Los Angeles Lakers",
    "renkler": "Mor, Altuni, Beyaz",
    "kucuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/kucuk_logo/losangeleslakers.png",
    "buyuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/buyuk_logo/losangeleslakers_biglogo.jpg",
    "takim_tarih": "Lakers ilk olarak 1946 yılında Detroit'te kurulan Detroit Gems takımının el değiştirmesiyle kuruldu. Sadece bir sene 1946-47 sezonunda Detroit'te kalan Gems, 1947 yılında Minnesotalı bir yatırımcı grubu olan Ben Berger ve Morris Chalfen tarafından 15.000$ karşılığında satın alındı. Minneapolis spor yazarı Sid Hartman iki tarafın anlaşmasının perde arkasında önemli rol oynadı. Daha sonra ekip takma adını ''10.000 Göller Ülkesi'' olarak belirledi. Hartman ayrıca takımın baş antrenörlük konusunda St. Thomas Kolejini çalıştıran John Kundla'yı koçluğa getirmesinde önemli rol oynadı. \n Lakers o dönemde forvet Jim Pollard, oyun kurucu Herm Schaefer, ve pivot George Mikan gibi NBL'nin dominant oyuncularını kadrosuna kattı. Nitekim takım ilk sezonunda 43-17'lik bir derece elde ederek lig lideri oldu."
  },
   {
    "index": 1,
    "takim_adi": "Boston Celtics",
    "renkler": "Yeşil, Beyaz, Siyah, Altın",
    "kucuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/kucuk_logo/boltonceltics.png",
    "buyuk_logo": "https://github.com/ssaricicek/hr180023sametsaricicek/blob/main/buyuk_logo/boltonceltics_biglogo.jpg",
    "takim_tarih": "Boston Celtics, 1946 yılında NBA kurulmadan önce bu ligin kurulmasına öncelik eden iki ligden biri olan Basketball Association of America (BAA) ligi takımı olarak kuruldu. Daha sonra bu ligin ülkenin diğer takımı ile birleşmesi sonrası NBA'in ilk takımlarından biri durumuna geldi. Önemli oyuncusu Bob Cousy önderliğinde başarılı sezonlar geçirdi."
  },
   {
    "index": 2,
    "takim_adi": "Miami Heat",
    "renkler": "Siyah, Koyu Kırmızı, Beyaz, Turuncu",
    "kucuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/kucuk_logo/miamiheat.png",
    "buyuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/buyuk_logo/miamiheat_biglogo.jpg",
    "takim_tarih": "1987 yılında, Florida eyaletinin şehirleri Miami, Orlando ve Tampa basketbol takımlarına ev sahipliği yapma kararı aldılar. NBA Şöhretler Müzesi'nin üyelerinden Billy Cunningham, onun arkadaşı Lewis Schaffel ve Ted Arison takımı kurma kararı aldılar.

1987'nin Nisan ayında Charlotte ve Minneapolis şehirleri NBA e katılmak için teklifte bulundular. Bunların yanında Orlando ve Miami şehirlerinin de teklifleri bulunuyordu. NBA uzun bir düşünme süresinden sonra NBA e Miami ve Charlotte şehirlerini dahil etmeye karar verdi. Charlotte Hornets ve Miami Heat 1988 yılında NBA e katıldılar. "
  },
   {
    "index": 3,
    "takim_adi": "Chicago Bulls",
    "renkler": "Kırmızı,Siyah,Beyaz",
    "kucuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/kucuk_logo/chicagobulls.jpg",
    "buyuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/buyuk_logo/chicagobulls_biglogo.png",
    "takim_tarih": "Chicago Bulls, Chicago Packers ve Chicago Stags'ten sonra NBA'de mücadele eden 3. Chicago takımıdır. Bulls adını almadan önce takımın ismi olan Chicago Amerikan Gears'ın ilk kurucusu Dick Klein oldu. Daha sonra takım Bulls adını aldıktan sonra ilk yıllarda Klein takımın hem başkanlığını hem de genel menajerlik görevlerini yaptı. \nTakım 1966/1967 sezonunda NBA'e giriş yaptı ve aldığı galibiyet yüzdesiyle NBA tarihindeki ilk sezonunda en iyi sonucu elde eden takım unvanını kazandı. Chicago eski NBA yıldızı Johnny Kerr'in koçluğunda ve oyuncular Bob Boozer ile Guy Rodgers'ın yardımıyla daha ilk sezonunda play-off'a kalma başarısı gösterdi ve Bulls ilk sezonunda play-off yapma başarısı gösteren tek takım oldu."
  },
   {
    "index": 4,
    "takim_adi": "Dallas Mavericks",
    "renkler": "Lacivert, Mavi, Gümüş, Beyaz, Siyah",
    "kucuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/kucuk_logo/dallasmavericks.png",
    "buyuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/buyuk_logo/dallasmavericks_biglogo.jpg",
    "takim_tarih": "Dallas Chaparrals'ın 1973'te San Antonio'ya taşınmasından sonra Dallas takımsız kalmıştı.Don Carter ve Norm Sonju 1979 yılında NBA yönetimine başvurdu ve Batı Konferansı, Ortabatı Grubu'ndan NBA'ye girdiler. Mavericks 1980 yılında NBA kariyerine başladığında her yeni takım gibi zorlanacağı düşünülüyordu. Fakat şaşırtıcı biçimde ilk 2 yıl play-off mücadelesi verdi ve 1983'te ligi 6. sırada bitirerek play-off vizesi almaya hak kazandı. 1981 ve 1983 NBA Seçmeleri'nde (NBA Draft) alınan Mark Aguirre ve Derek Harper, Mavericks'in sevgilisi olacak Brad Davis'in bu başarıda katkısı büyüktü. Sam Perkins'in de 1983 NBA Seçmelerinde takıma katılmasıyla sonraki yıllarda da playoff yarışında olmaya devam ettiler. \n1988'de Batı Konferansı finaline kadar çıktılar fakat Magic Johnson lı Los Angeles Lakers e elenmeleri sonrasında Mavs te sorunlar baş göstermeye başladı. Roy Tarples in uyuşturucudan başının belaya girmesi, önemli oyuncuların takas edilmesi takımın dibini kazıdı. 1990 yılındaki sürpriz play-off sonrasındaki seneler tam anlamıyla ligin dibinde berbat galibiyet sayılarıyla geçti. Jim Jackson Jamal Mashburn ve Jason Kidd in gelişiyle ligin sonundan yukarıya doğru tırmandılarsa da bir türlü beklenen başarı gelmedi. \n1996-97 sezonuyla takımda köklü değişikliklere gidildi. Michael Finley takıma dahil oldu, Don Nelson da takıma genel menajer oldu. 1998 de gelen Dirk Nowitzki ve Steve Nash ikilisine uyum sağlayan Finley ile beraber takım 11 yıl sonra 2001'de Playoff sevinci yaşadı. Başta bu üçlü takıma müthiş bir hücum gücü kattı, fakat Don Nelson'un sistemi yüzünden savunma en büyük sorunları olarak kaldı. \nNash 2004 sezonunun başında eski takımı Phoenix Suns'a gitti. Takım önemli bir parçasını kaybetse de özellikle Nowitzki'nin hep kendini geliştiren oyunuyla hala güçlü bir ekip olma özelliğini sürdürüyor. Gariptir ki ayrıldığı ilk sezonun sonunda ''En Değerli Oyuncu'' (MVP) ödülünü alan Nash Playoff eşleşmesinde Dallas'ı yıkan adam oldu.2007 yılında üst üste 17 galibiyet alarak kulüp rekorunu kırdı,normal sezon birinciliğiyle play-offları garantiledi.Fakat Golden State Warriors'a 4-2 ile elenmekten kurtulamadılar.\n2010-2011 sezonu Playoff'larında ise önce Portland Trail Blazers'i 4-2, sonrasında Los Angeles Lakers'i 4-0 ile geçerek batı konferansı finalinde Oklahoma City Thunder'ı 4-1 geçerek ikinci kez NBA Finaline çıktı.İlginç bir şekilde 2006'daki rakipleri Miami Heat ile eşleştiler.Dallas Mavericks LeBron'lu Wade'li kadrosuyla favori gösterilen Heat'i 4-2 yenerek tarihlerinde ilk kez NBA şampiyonu oldu. \n2010-2011 sezonunda Dirk Nowitzki, 24/24 serbest atış attığı 48 sayılık performansı ile Playoff rekorlar listesine girmiştir"
  },
{
    "index": 5,
    "takim_adi": "Houston Rockets",
    "renkler": "Beyaz,Siyah,Altuni,Gümüş",
    "kucuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/kucuk_logo/houstonrockets.png",
    "buyuk_logo": "https://raw.githubusercontent.com/ssaricicek/hr180023sametsaricicek/main/buyuk_logo/houstonrockets_biglogo.png",
    "takim_tarih": "NBA'de Güneybatı Grubu'nda yer alan Houston, Teksas takımıdır. 1967 yılında kurulmuştur . 1994 ve 1995 seneleri olmak üzere Hakeem Olajuwon önderliğinde 2 şampiyonluk kazanmışlardır. 1994 Yılında Hakeem Olajuwon MVP seçilmiştir. Hakeem Olajuwon'un 34 numaralı formasını emekli etmişlerdir. Yao Ming'i 2002'de draft etmiştir. 2008 Playoff'unda 1. turunda Utah Jazz'a 4-2 elenmişlerdir. 2008-2009 sezonu playoff yarı finalinde Los Angeles Lakers 'a 4-3 yenilerek elenmişlerdir. 2014-2015 Sezonu playoff konferans finaline kadar James Harden'ın muhteşem performansıyla çıkmışlardır ancak şampiyon Golden State Warriors takımına karşı konferans finallerini 4-1 yenilip elenmişlerdir. Maskotları bir fenomendir, rakip takım taraftarlarının yüzlerine pasta vurmasıyla bilinir ve daha çeşitli muzurlukları vardır. İsmi Clutch Bear'dır."
  }
]